[
  {
    "id": 101,
    "title": "Empowering Innovation: The Open Source Odyssey of Contribution and Collaboration with Jakarta EE",
    "abstract": "Esta sesión destaca el estado actual de Jakarta EE y las características clave de la próxima versión Jakarta EE 11 impulsada por la comunidad. Además, explora las consideraciones clave a la hora de embarcarse en el viaje del código abierto, y las contribuciones que las fundaciones de código abierto hacen a este ecosistema de colaboración.",
    "description": "El desarrollo de aplicaciones Java para empresas se prepara para un futuro prometedor bajo la dirección de Jakarta EE. La prosperidad de cualquier proyecto de código abierto depende de una comunidad dinámica que participe activamente en los avances tecnológicos. Únase a esta sesión para descubrir las razones y los métodos para convertirse en parte integrante de la comunidad de Jakarta EE y Eclipse Foundation, y descubra las características clave de la próxima versión Jakarta EE 11. La presentación pone de relieve valiosos conocimientos sobre la amplia colaboración que existe en todo el sector dentro del ámbito del código abierto, dedicada a la modernización de las soluciones Java empresariales.",
    "audience_level": "All",
    "time": "TBD",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "en",
    "tags": [
      "JakartaEE",
      "JavaEE",
      "OpenSource",
      "EclipseFoundation"
    ],
    "speakers": [
      "shabnam-mayel"
    ]
  },
  {
    "id": 102,
    "title": "Unlocking the Power of Multitenancy (Quarkus and Vaadin Flow)",
    "abstract": "¿Te has enfrentado a los desafíos de aplicaciones multitenancy? Descubre cómo dominarlo con Quarkus y Vaadin Flow, en este workshop. ¡Aprende estrategias efectivas para gestionar estas estructuras y crear aplicaciones escalables y seguras!",
    "description": "En la actualidad, el desarrollo de aplicaciones es un terreno complejo y desafiante. Los desarrolladores a menudo se encuentran con la necesidad de crear soluciones multitenancy para permitir intercambiar y compartir los recursos de las soluciones, garantizando la seguridad y la escalabilidad de esta.<br><br>Este workshop se enfoca en uno de los desafíos más comunes que enfrentan los desarrolladores: cómo integrar Vaadin Flow, una tecnología “stateful” que brinda interfaces de usuario ricas, con una API REST “stateless” en un ambiente Quarkus. Abordaremos los problemas que surgen cuando Vaadin Flow toma el control de la seguridad y cómo esto puede entrar en conflicto con la arquitectura “stateless” de Quarkus.<br><br>Exploraremos:<br>-\tLos desafíos específicos que surgen al combinar Vaadin Flow y Quarkus en un ambiente multitenancy.<br>-\tSoluciones prácticas para garantizar la seguridad y la interoperabilidad.<br>-\tDiseño de un API para aplicación de terceros.<br><br>Este workshop es ideal para desarrolladores, arquitectos de software y profesionales interesados en comprender cómo hacer que estas tecnologías puedan coexistir para construir aplicaciones seguras y escalables. Al final de la presentación, los asistentes tendrán una comprensión más sólida de cómo abordar este desafío en sus propios proyectos y lograr una integración exitosa.<br>",
    "audience_level": "Intermediate",
    "time": "TBD",
    "talk_format": "Workshop (\u003e 60 minutes)",
    "language": "es",
    "tags": [
      "Quarkus",
      "Vaadin",
      "VaadinFlow",
      "Java",
      "API",
      "Security"
    ],
    "speakers": [
      "freddy-pena",
      "juandiegolopezve"
    ]
  },
  {
    "id": 103,
    "title": "Java with OpenAI: Building and Monetizing Generative AI Plugins",
    "abstract": "Descubra cómo crear plugins de IA generativa utilizando Java en la plataforma OpenAI. Comience con los conceptos básicos de la API ChatGPT y Spring AI, y concluya lanzando un plugin Java completamente funcional en el mercado OpenAI. Aprenda estrategias para monetizar su plugin a millones de usuarios.",
    "description": "La red neuronal GPT de OpenAI puede mejorarse y personalizarse con plugins. Por ejemplo, el plugin de Expedia proporciona a la IA datos actualizados sobre precios y disponibilidad de alojamiento, permitiendo a los usuarios reservar su próximo viaje directamente a través de la interfaz ChatGPT. En esta sesión, obtendrá experiencia práctica con grandes modelos de lenguaje (LLM) mediante el desarrollo de un plugin Java para la plataforma OpenAI desde cero. Empezaremos por lo básico, creando una aplicación de IA generativa que integre Spring AI con las API de OpenAI para una variedad de tareas de procesamiento del lenguaje natural (PLN). A continuación, mejoraremos la capacidad de respuesta de la aplicación utilizando la extensión pgvector de Postgres para realizar búsquedas de similitud vectorial en la base de datos. Por último, descubrirás cómo lanzar y monetizar tu plugin Java en la plataforma OpenAI, haciéndolo accesible a millones de usuarios.",
    "audience_level": "All",
    "time": "TBD",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "en",
    "tags": [
      "Machine Learning with Java",
      "Machine Learning",
      "Java"
    ],
    "speakers": [
      "denis-magda"
    ]
  },
  {
    "id": 104,
    "title": "Integración de Java con MQTT para la Automatización del Hogar",
    "time": "TBD",
    "abstract": "Esta es una charla diseñada para demostrar el potencial de la domótica utilizando: Java y MQTT. Java nos brinda la robustez y versatilidad necesarias para desarrollar aplicaciones seguras, mientras que MQTT, con su ligereza y eficiencia, se establece como el estándar de comunicación ideal para IoT.",
    "description": "En esta charla, exploraremos cómo Java se une al versátil protocolo MQTT para crear soluciones de domótica. Comenzaremos introduciendo los conceptos fundamentales de la domótica y la importancia de la comunicación eficiente en los sistemas IoT.<br><br>Luego, profundizaremos en MQTT, destacando sus características clave como la eficiencia, la fiabilidad y la arquitectura publish/subscribe, que lo hacen ideal para la automatización residencial.<br><br>A continuación, nos adentraremos en cómo Java, puede ser utilizado para desarrollar aplicaciones de domótica que se comunican con dispositivos IoT a través de MQTT. Cubriremos las **bibliotecas Java que facilitan esta integración** y proporcionaremos ejemplos de código para ilustrar la interacción entre una aplicación Java y dispositivos IoT mediante MQTT.<br><br>También discutiremos las **mejores prácticas para garantizar la seguridad** y la privacidad en las comunicaciones MQTT, abordando el uso de TLS/SSL, autenticación y autorización. Además de consejos sobre cómo manejar la reconexión y asegurar la entrega de mensajes para construir sistemas de domótica fiables y resilientes.<br><br>Finalmente, se presentará un demo de conexión de una aplicación Java con un broker MQTT para la transferencia de mensajes a dispositivos inteligente",
    "audience_level": "Intermediate",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "tags": [
      "IoT",
      "Java",
      "MQTT",
      "Domotica"
    ],
    "speakers": [
      "frank_jcg"
    ]
  },
  {
    "id": 105,
    "title": "Desbloqueando el Potencial de los equipos Desarrollo de Software con Team Topologies",
    "abstract": "En nuestra charla, exploraremos cómo  revolucionar la forma en como desarrollamos software.<br><br>Descubre cómo romper los silos organizacionales, fomentar la colaboración y mejorar la calidad del software.",
    "description": "Team Topologies es más que una simple estructura organizativa; es un enfoque holístico que impulsa la innovación, fomenta la colaboración y mejora la calidad del software.<br><br>Abordaremos los desafíos comunes en el desarrollo de software, como la falta de comunicación, la complejidad del proceso y la resistencia al cambio, y mostraremos cómo Team Topologies ofrece soluciones prácticas y efectivas para estos problemas.<br><br>A lo largo de la charla, aprenderás los principios fundamentales de Team Topologies y cómo aplicarlos en tu equipo. Descubrirás cómo identificar roles y responsabilidades, establecer límites evolutivos claros y fomentar una cultura de experimentación y aprendizaje continuo.<br><br>Además, presentaremos casos de estudio reales de empresas que han implementado con éxito Team Topologies y han experimentado mejoras significativas en la eficiencia, la calidad del software y la satisfacción del equipo.<br><br>Ya sea que seas un desarrollador, un líder de equipo o un gerente de proyecto, esta charla te proporcionará las herramientas y los conocimientos necesarios para desbloquear el potencial de tu equipo y llevar tu desarrollo de software al siguiente nivel.",
    "audience_level": "Intermediate",
    "time": "TBD",
    "language": "All",
    "talk_format": "Talk (~30-45 minutes)",
    "tags": [
      "Estrategias",
      "Herramientas",
      "Metodologías"
    ],
    "speakers": [
      "david-joa"
    ]
  },
  {
    "id": 106,
    "title": "Profundizando en la arquitectura de micro-servicios con Java Spring",
    "abstract": "¿Has tenido problemas implementando micro servicios? ¿Algunas cosas son más complejas de resolver y sientes que es un desperdicio de recursos? Pues ven a unirte a este charla donde hablaremos del escalado, implementación y uso de esta hermosa arquitectura en las aplicaciones del hoy día",
    "description": "Realizar una implementación de esta arquitectura es más complejo de lo que se puede imaginar, el hecho de no conocer los<br>conceptos y fundamento que la componen, te lleva a una implementación parcial o incompleta dando paso a problemas que a<br>su vez plantean soluciones que evitan que se aprecien las bondades de esta arquitectura.<br><br>Entre las características más brillantes de las aplicaciones en micro-servicios; es su escalado (horizontal y vertical),<br>ya que estas aplicaciones escalan de forma automatizada y a demanda, y si el resultado de su implementación no da paso a<br>esta característica en particular entonces estamos frente a un caso de una mala implementación de la misma.<br><br>**El simple hecho de no conocer conceptos fundamentales y/o elementos que componen esta arquitectura, te llevará a un<br>caos y junto a eso a una implementación que brindará más dolores de cabeza que ventajas.**<br><br>Con esta charla, busco hacer que quien decida implementar este tipo de arquitectura orientada al servicio pueda hacerlo<br>de una forma saludable y en los escenarios correctos, puesto no siempre puedes usarla debido a:<br><br>- Dimensiones de la aplicación:<br>    - cantidad de usuarios<br>    - Costos<br>- Necesidades del usuario en la aplicación<br>    - Tipo de conexiones<br>    - Restricciones de ley con la data<br>    - Limitaciones de hardware<br>- Otros factores que afectarán el desarrollo:<br>    - Flujo de trabajo del código<br>    - Despliegue del código a los entornos<br>    - Experiencia del equipo (grupal e individual)<br>    - Tiempo de entrenamiento interno del equipo<br>    - Hábitos de documentación<br>    - ...<br>",
    "audience_level": "All",
    "time": "TBD",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "tags": [
      "Java",
      "Spring Framework",
      "micro-servicios"
    ],
    "speakers": [
      "aluis-marte"
    ]
  },
  {
    "id": 107,
    "title": "Codificación Segura en Java: Prevención y defensa",
    "abstract": "¿Es Java seguro? ¿Es seguro tu código? ¿Puede ser vulnerada tu aplicación? Exploremos los aspectos esenciales de la seguridad en el desarrollo de aplicaciones Java, las vulnerabilidad más comunes, como identificarlas y cómo mitigarlas.",
    "description": "En esta conferencia interactiva, exploraremos los aspectos esenciales de la seguridad en el desarrollo de aplicaciones Java, proporcionando un enfoque práctico y orientado a la acción para desarrolladores intermedios. Aprenderás a identificar y mitigar vulnerabilidades comunes, implementar técnicas de seguridad efectivas y proteger tus aplicaciones contra amenazas en constante evolución.",
    "audience_level": "Intermediate",
    "time": "TBD",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "tags": [
      "java",
      "seguridad",
      "security",
      "código seguro"
    ],
    "speakers": [
      "berroteranlkf"
    ]
  },
  {
    "id": 108,
    "title": "Unlock the potential of Jakarta REST to build RESTful Web Services",
    "abstract": "Aprovechar la potencia de Jakarta EE para crear servicios web RESTful",
    "description": "En este taller, obtendrás una introducción a las nuevas y actualizadas APIs de la Plataforma Jakarta EE 10. Obtendrás experiencia práctica de la Plataforma con ejercicios prácticos de APIs seleccionadas de Jakarta EE 10. Obtendrás experiencia práctica de la Plataforma con ejercicios prácticos de las APIs seleccionadas de Jakarta EE 10. El enfoque del taller será construir Servicios Web RESTful con Jakarta EE. Usted aprenderá cómo implementar sus servicios a un servidor de aplicaciones tradicionales, así como la forma de crear un JAR de arranque con el mecanismo SEBootstrap proporcionado por Jakarta EE RESTful Web Services.<br>¿Sabía usted que usted no necesita una biblioteca externa como Jackson o Gson para el procesamiento de JSON?<br>Usted aprenderá cómo aprovechar el poder de las APIs de Jakarta EE para serializar JSON a objetos Java y viceversa. Todo lo que necesitas saber para tener éxito en la creación de Servicios Web RESTful con Jakarta EE.",
    "audience_level": "Intermediate",
    "time": "TBD",
    "talk_format": "Workshop (\u003e 60 minutes)",
    "language": "en",
    "tags": [
      "Java",
      "Jakarta EE",
      "Jakarta REST",
      "RESTful Web Services",
      "Jakarta EE 10"
    ],
    "speakers": [
      "ivar-grimstad",
      "ecabrerar"
    ]
  },
  {
    "id": 109,
    "title": "Infraestructura como Código para Todos",
    "abstract": "Porque repetir la mismas tareas una y otra vez? Porque no invertir un tiempo y resolver esas tareas que siempre repites? Tenemos las herramientas y el conocimiento para no entrar en este loop tareas.",
    "description": "El taller sobre Infraestructura como Código (IaC) ofrecerá una introducción exhaustiva a los principios, herramientas y mejores prácticas para automatizar la gestión de infraestructura a través de código. Desde los fundamentos conceptuales hasta la implementación práctica, los participantes explorarán cómo IaC mejora la eficiencia operativa, la escalabilidad y la consistencia en entornos de desarrollo, pruebas y producción. Se abordarán temas clave como la creación de plantillas reutilizables, el uso de herramientas como Pulumi, OpenTofu (Terraform) y Ansible, y estrategias para la gestión de cambios y la colaboración en equipos.<br><br>Nos enfocaremos en Pulumi en versión Java, y Ansible.",
    "audience_level": "All",
    "time": "TBD",
    "talk_format": "Workshop (\u003e 60 minutes)",
    "language": "es",
    "tags": [
      "IaC",
      "Java",
      "Ansible",
      "OpenTofu",
      "Terraform",
      "Vagrant"
    ],
    "speakers": [
      "hector-ventura"
    ]
  },
  {
    "id": 110,
    "title": "¡No más scripts!, Utiliza Apache Nifi para tus flujos de datos",
    "abstract": "Imagina un flujo constante de datos entre sistemas dispares en tu empresa: registros, transacciones, lecturas, y más. Ahora, piensa en solución que simplifica ese flujo de datos, en una plataforma poderosa para automatizar su movimiento, transformación y entrega en tiempo real. Eso Apache NiFi!.",
    "description": "Imagina un flujo constante de datos viajando a través de sistemas dispares en tu empresa: registros de servidores, transacciones de clientes, lecturas de sensores, y más. Ahora, visualiza una solución que simplifica radicalmente la gestión de este flujo de datos, ofreciendo una plataforma única y poderosa para automatizar su movimiento, transformación y entrega en tiempo real. Esa solución es Apache NiFi.<br><br>Apache NiFi es la herramienta definitiva para el flujo de datos en tiempo real. Con una interfaz gráfica intuitiva y fácil de usar, NiFi permite a los usuarios diseñar, controlar y monitorear flujos de datos de manera visual, sin necesidad de escribir código. Desde la ingestión de datos hasta su procesamiento y distribución, NiFi simplifica cada paso del proceso, permitiendo a las organizaciones gestionar eficientemente grandes volúmenes de datos de manera confiable y escalable.<br><br>¿Qué hace a Apache NiFi tan especial? En primer lugar, su capacidad para integrar fácilmente una amplia variedad de fuentes y destinos de datos. Desde bases de datos y sistemas de archivos hasta dispositivos IoT y servicios web, NiFi puede conectarse con casi cualquier fuente de datos imaginable. Además, NiFi ofrece potentes capacidades de procesamiento en tiempo real, permitiendo a los usuarios realizar transformaciones, enriquecimientos y análisis de datos sobre la marcha.<br><br>En nuestra presentación estaremos abordando los aspectos básicos de la herramienta y mostrando escenarios de situaciones reales donde Apache Nifi nos ha permitido agilizar nuestro trabajo, sin necesidad de crear scripts o aplicativos específicos para resolver esa situación. Los ejemplos propuestos son:<br><br>- Integración de información entre varias fuentes de datos (SQL, No SQL, Servicios Web, entre otros).<br>- Cambio de fuente de datos entre sistemas (SQL a No SQL).<br>- Implementación de un Change data capture (CDC) desde una base de datos SQL.",
    "audience_level": "Intermediate",
    "time": "TBD",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "tags": [
      "Java",
      "Apache Nifi",
      "ELT",
      "Data Streaming",
      "Streaming",
      "SQL",
      "NO SQL"
    ],
    "speakers": [
      "ccamachog"
    ]
  },
  {
    "id": 111,
    "title": "Hablando de basura: Garbage Collector, ¿Qué es?  ¿Cómo funciona? ¿Cuál debería utilizar en mi aplicación?",
    "abstract": "Aumentar la cantidad de instancias de tu aplicación o la memoria disponible solo esconderá el problema real de esta. <br><br>Hablemos sobre basura, para entender cómo la JVM maneja la memoria de tu aplicación y cómo puedes maximizar el rendimiento de esta con una gestión efectiva de su memoria.",
    "description": "Hablemos de basura, además de su importancia en recolectarla a tiempo para mantener una aplicación en su punto más óptimo y costo eficiente. <br><br>Hoy en día se ha vuelto una práctica común resolver todos los problemas de rendimiento, aumentando la cantidad de recursos disponibles en el hardware donde alojamos nuestras aplicaciones. <br><br>En esta charla, abordaremos los conceptos envueltos en el funcionamiento del <br>Garbage Collector (GC) en el JVM, la evolución de los algoritmos de Garbage Collection a través de los años y cuál es el más óptimo a utilizar dependiendo de cuáles son los puntos críticos de tu aplicación. Veremos brevemente distintas herramientas de monitoreo y visualización que nos ayudarán a entender en tiempo real, de manera gráfica, el comportamiento de la memoria en nuestra aplicación.",
    "audience_level": "Intermediate",
    "time": "TBD",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "tags": [
      "Java",
      "Garbage Collector",
      "JVM",
      "Java Platform"
    ],
    "speakers": [
      "brayan-munoz"
    ]
  },
  {
    "id": 112,
    "title": "AWSome Testing con LocalStack y Testcontainers",
    "abstract": "La ejecución de las pruebas deben proveer feedback rápido. Al ejecutar en una infraestructura real están aumentan costos y toman tiempo. LocalStack y Testcontainers permiten realizar pruebas locales y reales sin un ambiente de producción.",
    "description": "Hoy en día muchas aplicaciones se integran con servicios cloud como AWS, Azure, GCP. Sin embargo, el desarrollo y pruebas de estas aplicaciones puede ser un reto debido a los costos y la velocidad de desarrollo. Esta charla presentará LocalStack para emular los servicios de AWS localmente y Testcontainers para ejecutar LocalStack como contenedor e integrarlo en el ciclo de vida de las pruebas de manera programática.",
    "audience_level": "Intermediate",
    "time": "TBD",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "tags": [
      "java",
      "testcontainers",
      "aws",
      "spring boot",
      "junit"
    ],
    "speakers": [
      "eddumelendez"
    ]
  },
  {
    "id": 113,
    "title": "Integración de Spring Boot con PayPal y Buenas Prácticas",
    "abstract": "Participa en nuestro workshop para dominar la integración de PayPal en tus aplicaciones de Spring Boot. Exploraremos técnicas esenciales como el uso de Spring Cache con Redis y métodos avanzados de pruebas, tanto unitarias como de integración. Este taller es perfecto para desarrolladores que buscan implementar transacciones seguras y mejorar la eficiencia de sus aplicaciones en línea.",
    "description": "En este taller, explicaremos cómo integrar la pasarela de pagos PayPal con aplicaciones desarrolladas en Spring Boot, facilitando transacciones seguras y eficientes. A través de ejemplos prácticos, aprenderás a configurar y manejar pagos en línea, un componente esencial para cualquier negocio digital.<br><br>Integración de PayPal:<br>Detallaremos paso a paso cómo incorporar PayPal en tus proyectos de Spring Boot, desde la configuración inicial hasta el manejo de transacciones y la seguridad en los pagos.<br><br>Además, el workshop incluirá sesiones sobre:<br>Uso de Spring Cache con Redis:<br>Aprenderemos a implementar caching para mejorar la eficiencia y respuesta de las aplicaciones.<br>Creación y uso de Anotaciones con Spring AOP:<br>Introduciremos cómo crear anotaciones personalizadas para manejar excepciones, utilizando Spring AOP para simplificar la gestión de errores.<br><br>Pruebas en Spring:<br>Profundizaremos en cómo realizar pruebas efectivas en diferentes niveles de la aplicación:<br>Servicios y Componentes<br>Controladores utilizando MockMvc<br>Repositorios con Spring Data JPA<br><br>Únete a nosotros para desarrollar tus habilidades en la creación de aplicaciones comerciales con Spring Boot, donde no solo aprenderás sobre integraciones de pagos, sino también sobre optimización de rendimiento y pruebas rigurosas para garantizar la calidad del software.",
    "audience_level": "Intermediate",
    "time": "TBD",
    "talk_format": "Workshop (\u003e 60 minutes)",
    "language": "es",
    "tags": [
      "java",
      "Redis",
      "spring boot",
      "Spring Cache"
    ],
    "speakers": [
      "geovanny-mendoza"
    ]
  },
  {
    "id": 114,
    "title": "JPA, Hibernate or JOOQ or Maybe all of them?",
    "abstract": "Descubre JPA, Hibernate y JOOQ en Java para optimizar la persistencia de datos. Aprende consultas tipo-safe y mapeo objeto-relacional. Mejora tus estrategias de manejo de datos en 45 minutos, ya seas nuevo o experimentado en Java.",
    "description": "En esta charla exploraremos las opciones avanzadas para la persistencia de datos en aplicaciones Java. Desde el estándar JPA hasta las potentes implementaciones como Hibernate y JOOQ, descubrirás cómo cada una simplifica y potencia el manejo de datos. <br><br>A través de ejemplos prácticos y comparaciones detalladas, aprenderás a elegir la tecnología adecuada según los requisitos de tu proyecto.<br><br> Únete para profundizar en la eficiencia y flexibilidad de la persistencia de datos en Java.",
    "audience_level": "All",
    "time": "TBD",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "tags": [
      "SQL",
      "JPA",
      "Hibernate",
      "JDBC",
      "JOOQ",
      "JDBI",
      "SQL2O",
      "Apache Delta Spike",
      "Spring Data",
      "Quarkus Panache"
    ],
    "speakers": [
      "eliezer-herrera"
    ]
  },
  {
    "id": 115,
    "title": "Creando una aplicación con JavaFx y Hibernate",
    "abstract": "¿Te gustaría aprender a combinar la potencia de JavaFX con la eficiencia de Hibernate y PostgreSQL? En esta charla, te mostraré cómo desarrollar una aplicación de escritorio con interfaces gráficas de usuario (GUI) en Java utilizando JavaFX integrando un framework ORM como Hibernate.",
    "description": "JavaFX es un conjunto de herramientas y bibliotecas de software que se utiliza para desarrollar aplicaciones de escritorio con interfaces gráficas de usuario (GUI) en Java.<br><br> Por otro lado, Hibernate es un framework de mapeo objeto-relacional (ORM) diseñado para Java, lo que permite a los desarrolladores mapear objetos Java a las tablas de una base de datos relacional. <br><br> Durante esta charla, exploraremos la integración de JavaFX con Hibernate, lo que implica la creación de una aplicación que se conecta a una base de datos PostgreSQL utilizando Hibernate. Esta aplicación permitirá realizar operaciones CRUD (crear, leer, actualizar y eliminar) en la base de datos y mostrar los datos en componentes JavaFX",
    "audience_level": "All",
    "time": "TBD",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "tags": [
      "JavaFX",
      "Hibernate"
    ],
    "speakers": [
      "yesser-miranda"
    ]
  }
]