[
  {
    "id": 101,
    "title": "Jakarta EE Meets AI",
    "abstract": "Why learn new languages? Java has all you need for integrating Large Language Models (LLMs) into enterprise apps. Join me for live demos with LangChain4J, Spring AI, and Jakarta EE, and see how easily Java can be used for AI in your applications!",
    "description": "Most of us are not writing our own Large Language Models (LLMs). We are consuming them, and integrating them into our enterprise applications. Ang guess what? Java is the perfect language for this! You don't have to learn Python or any other language for your AI integrations.<br><br>This session will explore different options there are for Java developers and how to integrate them into your enterprise Java applications. There will be live demos using libraries and tools such as LangChain4J, Spring AI, and Jakarta EE.",
    "audience_level": "All",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "en",
    "display": true,
    "featured": true,
    "tags": [
      "AI",
      "Java",
      "Architecture",
      "Jakarta EE"
    ],
    "speakers": [
      "ivar-grimstad"
    ]
  },
  {
    "id": 102,
    "title": "Java y grafos. Iniciemos con Neo4j",
    "abstract": "Los NoSQL ya son el día a día de nuestras aplicaciones, de entre los distintos tipos, existe uno que a veces no exploramos para nuestras soluciones: las orientadas a grafos.<br>En esta charla veremos por qué son importantes y cómo podemos usarlas en nuestros proyectos con Java.",
    "description": "Las bases de datos orientadas a grafos siguen avanzando de manera discreta en el día a día de las soluciones informáticas.<br>La intención de esta charla es:<br><br>Recordar la importancia de una bbdd orientada a grafos.<br>Ver algunos casos de uso.<br>Saber por dónde empezar usando recursos gratuitos (conoceremos un servicio gratuito de neo4j).<br>Como conectarnos usando java (springboot, quarkus, helidon, micronaut).",
    "audience_level": "All",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "display": true,
    "featured": false,
    "tags": [
      "Java Platform",
      "nosql",
      "neo4j",
      "graph",
      "databases"
    ],
    "speakers": [
      "isaac-ruiz"
    ]
  },
  {
    "id": 103,
    "title": "Helidon 4 en Kubernetes: Lecciones Reales, Retos y Casos de Uso en Producción",
    "abstract": "Descubre cómo llevar Helidon 4 a producción en Kubernetes. Exploraremos lecciones aprendidas, retos enfrentados y casos de uso reales con Eclipse MicroProfile, bases de datos y servicios externos. Una charla con insights clave para optimizar distintas cargas de trabajo en el mundo real.",
    "description": "Helidon 4, basado en Eclipse MicroProfile, es una opción poderosa para micro servicios en Kubernetes. En esta charla, compartiré lecciones aprendidas, retos enfrentados y casos de uso reales en producción, desde integración con bases de datos hasta consumo de APIs externas. Una sesión práctica con insights clave para optimizar distintas cargas de trabajo.",
    "audience_level": "Intermediate",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "display": true,
    "featured": false,
    "tags": [
      "Java Platform",
      "Server side development"
    ],
    "speakers": [
      "jesus-aguirre"
    ]
  },
  {
    "id": 104,
    "title": "De las Trincheras a Producción: Dominando GraalVM con Spring Boot",
    "abstract": "Sumérgete en experiencias reales con GraalVM y Spring Boot. Aprende a reducir uso de memoria, CPU y tiempos de arranque, creando contenedores más pequeños y manejando altas cargas. Esta charla ofrece soluciones prácticas para builds nativos, configuración de plugins y automation con  github action.",
    "description": "Aunque GraalVM promete arranques rápidos, menor consumo de recursos y capacidades políglotas, el camino a producción no siempre es simple. En esta sesión compartiré lecciones aprendidas trabajando con clientes que usan Spring Boot y GraalVM, enfocándome en modos JIT y Nativo. Cubriremos la configuración de plugins Maven como bootRun, bootBuildImage y graalvmNative, el manejo de reflexión y proxies dinámicos, y la automatización de generación de metadatos usando el repositorio de reachability de GraalVM. Esta no es solo otra demo: es un recorrido detallado desde la perspectiva de un programador, resaltando desafíos y soluciones al llevar aplicaciones reales a producción con GraalVM. También mostraremos despliegues con GitHub Actions y ejemplos de programación políglota práctica.",
    "audience_level": "Intermediate",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "display": true,
    "tags": [
      "Java Platform"
    ],
    "speakers": [
      "jose-diaz"
    ]
  },
  {
    "id": 105,
    "title": "30 years programming: Lessons learned",
    "abstract": "I have been programming for 30 years now. During this time I have learned many lessons about work, code, software, tech in general that I'd like to share with you.<br>I want to talk about cyclic patterns I've noticed throughout all these years, in the hopes we can stop making the same mistakes",
    "description": "I want to talk about what programming was 30 years ago, and what it has become today. Look at the trendy things that have come and gone, and come back again. Not in a \"get off my lawn\" tone, but rather to show how this industry is not that different from others; the good, the bad, the ugly. How Open Source changed the industry, and how the industry changed Open Source. What's in store for the newer generations.",
    "audience_level": "Intermediate",
    "language": "es",
    "display": true,
    "featured": false,
    "talk_format": "Talk (~30-45 minutes)",
    "tags": [
      "software development",
      "programming",
      "cloud",
      "Server side development",
      "Java Platform",
      "web development",
      "client-side development"
    ],
    "speakers": [
      "enrique-zamudio"
    ]
  },
  {
    "id": 106,
    "title": "How and why to participate in the future of the Java Platform",
    "abstract": "Learn about how to participate in the evolution and how to grow and build the next generation of Java developers, how we are working to advance of adoption of new versions of Java in the ecosystem. Also how we are evolving Java to be the platform of choice for AI workloads",
    "description": "Much of the success of the Java programming language can be attributed to how the language evolves and how the worldwide community of #Javadevelopers collaborates in that evolution. It is you— members of the Java community who make that possibility a reality. The Java Community Process (JCP) Program is the process by which the international Java community standardizes and ratifies the specifications for Java technologies. We are celebrating 30 years of Java in 2025! The community collaboration in the JCP program is essential to Java.  Learn about how to participate in the evolution and how to grow and build the next generation of Java developers, how we are working to advance of adoption of new versions of Java in the ecosystem. Also how we are evolving Java to be the platform of choice for AI workloads, We are looking forward to future innovations and community collaboration in the years to come. Learn what’s new in the platform in Java 25 and beyond, and how to participate in the community.",
    "audience_level": "All",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "en",
    "display": true,
    "featured": true,
    "tags": [
      "java"
    ],
    "speakers": [
      "heather-vancura"
    ]
  },
  {
    "id": 107,
    "title": "At Long Last, Queues for Apache Kafka - Unpacking Shared Groups (KIP-932)",
    "abstract": "Shared groups (KIP-932) brings \\\"queues\\\" to the Apache KafkaⓇ ecosystem. The guarantees of durability, scalability, and high throughput we’ve always touted in Kafka, all while scaling consumption beyond the partition count and better support for transactional workloads. Let’s unpack it together.",
    "description": "Apache KafkaⓇ powers 80 percent of the Fortune 500 as a highly scalable event-streaming platform. Consumer groups assign partitions to members of the group, providing a powerful combination of ordering and scalability. But how can we scale the consumers in a group beyond the number of partitions of a topic?<br><br>Enter KIP-932 - aka “Queues for Kafka” - enabling multiple consumers in the group to process from the same topic-partition. In this session we’ll explore how shared groups provide better support for transactional workloads, load balancing, and event ordering, all while leveraging Kafka’s scalability and durability features. We’ll discuss how shared groups differ from classic consumer groups and when to use them. What better way to do this than actually looking at code? Let’s do that.<br><br>Shared groups make Kafka an even stronger alternative to traditional message brokers. Kafka veterans and beginners alike will find this session of interest, prompting you to rethink event processing.<br>",
    "audience_level": "Intermediate",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "en",
    "display": true,
    "featured": false,
    "tags": [
      "Server side development",
      "Java Platform"
    ],
    "speakers": [
      "sandon-jacobs"
    ]
  },
  {
    "id": 108,
    "title": "Getting Groovy: AI-Powered Spock Testing",
    "abstract": "Spock is a powerful testing framework for Java and Groovy, offering an expressive, efficient way to write tests. Imagine combining Spock with AI to supercharge your testing process. In this talk, see live coding that demonstrates how AI enhances test creation!",
    "description": "Spock is a testing framework for Java and Groovy applications known for its expressive specification language. With a JUnit runner, it integrates seamlessly with IDEs, build tools, and CI servers. Inspired by JUnit, RSpec, Groovy, Scala, and Vulcans, Spock brings a unique and efficient approach to testing. It utilizes Groovy’s Abstract Syntax Tree (AST) to eliminate boilerplate, enabling a fluid domain-specific language for tests.<br><br>Now, imagine taking Spock to the next level with AI. By integrating AI into testing, we can enhance efficiency and intelligence.<br><br>In this talk, I’ll minimize slides and focus on live coding to demonstrate the power of Spock with AI assistance. You’ll learn how AI tools can help write robust tests and elevate your testing skills. Join me to explore Spock and discover how AI can transform your testing approach.",
    "audience_level": "All",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "en",
    "display": true,
    "featured": false,
    "tags": [
      "Java Platform",
      "unit testing"
    ],
    "speakers": [
      "david-parry"
    ]
  },
  {
    "id": 109,
    "title": "Agilidad para Desarrolladores: Creando Software de Calidad de Forma Continua",
    "abstract": "La agilidad no es solo seguir marcos de trabajo, sino desarrollar software de calidad de forma continua y sostenible. En esta charla, aprenderás cómo aplicar Agilidad para entregar valor, construir buen software y usar Scrum, Kanban y XP para un flujo eficiente sin comprometer la calidad.",
    "description": "En el mundo del desarrollo de software, la rapidez y la calidad a menudo parecen estar en conflicto. Sin embargo, con un enfoque ágil bien aplicado, es posible entregar software de alto valor de manera continua sin sacrificar la estabilidad ni la excelencia técnica.<br><br>En esta charla, exploraremos cómo los desarrolladores pueden aprovechar la agilidad para mejorar su proceso de construcción de software. Abordaremos temas clave como:<br>El ciclo de vida del desarrollo ágil: Cómo gestionar desde la idea hasta la entrega de valor de manera iterativa y eficiente.<br>Planificación ágil: Estrategias para planificar el trabajo sin caer en la burocracia ni en la falta de previsión.<br>Scrum, Kanban y XP: Cómo elegir y combinar estos marcos de trabajo para optimizar el flujo de desarrollo.<br>Entrega continua y calidad del código: Prácticas que aseguran que el software se mantenga en producción sin interrupciones ni regresiones.<br>Colaboración y mejora continua: Cómo fomentar la comunicación efectiva dentro del equipo y adaptarse al cambio de manera fluida.<br><br>Si eres desarrollador y quieres construir software de calidad de forma sostenible, esta charla te dará las herramientas y enfoques necesarios para lograrlo con agilidad.",
    "audience_level": "All",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "display": true,
    "featured": false,
    "tags": [
      "Proceso de desarrollo de Software",
      "Metodología"
    ],
    "speakers": [
      "david-joa"
    ]
  },
  {
    "id": 110,
    "title": "Destripando la JVM: Instrumentación y Bytecode de Java",
    "abstract": "¿Te gustaría saber cómo frameworks como Mockito, Spring y Hibernate modifican clases en tiempo de ejecución? Aprende a interceptar y redefinir código sin tocar el fuente usando Java Agents e instrumentación. Desde profiling hasta auditoría, descubre cómo estas técnicas se aplican en el mundo real.",
    "description": "Aunque GraalVM promete arranques rápidos, menor consumo de recursos y capacidades políglotas, el camino a producción no siempre es simple. En esta sesión compartiré lecciones aprendidas trabajando con clientes que usan Spring Boot y GraalVM, enfocándome en modos JIT y Nativo. Cubriremos la configuración de plugins Maven como bootRun, bootBuildImage y graalvmNative, el manejo de reflexión y proxies dinámicos, y la automatización de generación de metadatos usando el repositorio de reachability de GraalVM. Esta no es solo otra demo: es un recorrido detallado desde la perspectiva de un programador, resaltando desafíos y soluciones al llevar aplicaciones reales a producción con GraalVM. También mostraremos despliegues con GitHub Actions y ejemplos de programación políglota práctica.",
    "audience_level": "Intermediate",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "display": true,
    "featured": false,
    "tags": [
      "Java Platform"
    ],
    "speakers": [
      "jorge-morla"
    ]
  },
  {
    "id": 111,
    "title": "Trabajando de Manera Sostenible en un Mundo Acelerado",
    "abstract": "El equilibrio entre el rendimiento profesional y el bienestar es clave para una carrera sostenible en tecnología. Esta charla aportará herramientas prácticas para que los desarrolladores puedan trabajar con mayor enfoque, salud y motivación a largo plazo.",
    "description": "El desarrollo de software es una industria dinámica y desafiante, con ritmos acelerados, altas expectativas y entornos demandantes. Esta charla explorará estrategias para trabajar de manera sostenible sin comprometer el bienestar. Se abordarán aspectos como el trabajo remoto sostenible, la adopción de hábitos saludables, y cómo desarrollar resiliencia emocional para afrontar los retos laborales con una mentalidad equilibrada.<br>También se discutirán estrategias como el mindfulness para el manejo del estrés, la mentalidad de crecimiento para asumir retos de manera curiosa, y la importancia de mantenerse actualizado sin caer en el agotamiento. La charla estará respaldada por investigaciones, datos y experiencias del sector.",
    "audience_level": "All",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "display": true,
    "featured": false,
    "tags": [
      "Trabajo Sostenible",
      "Trabajo Remoto"
    ],
    "speakers": [
      "mirna-de-jesus-cambero"
    ]
  },
  {
    "id": 112,
    "title": "Kotlin Coroutines: Más Allá del async/await",
    "abstract": "La concurrencia en Kotlin es poderosa, pero usar coroutines de manera eficiente puede ser un reto. En esta charla veremos cómo manejarlas correctamente, ejecutar tareas en paralelo y aprovecharlas para procesamiento asíncrono, además de compartir errores comunes y mejores prácticas.",
    "description": "Kotlin Coroutines: Más Allá del async/await.<br><br>Kotlin ha revolucionado la programación asíncrona con <b>coroutines</b>, pero su verdadero potencial va mucho más allá de `async/await`. En esta charla, exploraremos:  <br><br> 1-<b>Ejecución en paralelo</b> y estrategias eficientes.<br> 2-<b>Flows y Streams</b> para manejar datos asíncronos.<br> 3- <b>Errores comunes</b> y cómo evitarlos. <br> 4- <b>Patrones avanzados</b> para maximizar rendimiento y seguridad.<br><br>Si quieres dominar la concurrencia en Kotlin y escribir código más limpio y eficiente, esta sesión es para ti.",
    "audience_level": "Intermediate",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "es",
    "display": true,
    "featured": false,
    "tags": [
      "Kotlin",
      "Coroutines",
      "Flows",
      "Streams",
      "Threads"
    ],
    "speakers": [
      "aneudy-vargas"
    ]
  },
  {
    "id": 113,
    "title": "Optimizing LLM Responses with Retrieval-Augmented Generation (RAG) in Java",
    "abstract": "Large Language Models (LLMs) are powerful, but they struggle with real-time knowledge and hallucinate answers. In this hands-on workshop, learn how to supercharge your LLM-powered chatbot with Retrieval-Augmented Generation (RAG) using Java, and SpringAI.",
    "description": "LLMs alone are not enough. Without real-time retrieval, they generate outdated or incorrect responses, either because their knowledge is limited or because they lack access to pertinent information. This could make them unreliable for business-critical applications. This workshop dives into Retrieval-Augmented Generation (RAG)—a technique that enables AI to access real-world, up-to-date information to deliver accurate, context-rich responses.<br><br>We'll guide you through building an AI chatbot from scratch using Java and SpringAI with a vector database (PGVector or Neo4j, for example) . You'll learn how to:<br><br>✔ Integrate SpringAI to build a robust chatbot<br>✔ Implement RAG to enhance chatbot accuracy and avoid hallucinations<br>✔ Store and retrieve real-time product data from a vector database<br>✔ Live test and compare results with vs. without RAG<br><br>This workshop is perfect for developers, and AI engineers looking to implement practical, enterprise-grade AI solutions. Don't miss this opportunity to master RAG and transform how AI-powered applications interact with data.",
    "audience_level": "Intermediate",
    "talk_format": "Workshop (\u003e 60 minutes)",
    "language": "es",
    "display": true,
    "featured": false,
    "tags": [
      "AI",
      "machine-learning",
      "llm",
      "java",
      "SpringAI",
      "chatbot",
      "vector-database",
      "retrieval-augmented-generation",
      "enterprise-ai",
      "Machine Learning with Java",
      "Java Platform"
    ],
    "speakers": [
      "rafael-almonte",
      "brayan-munoz"
    ]
  },
  {
    "id": 114,
    "title": "How to use Jakarta 11 with Payara 7",
    "abstract": "The intention of this workshop will be to review how to use Payara 7 and how Payara 7 is supporting Jakarta 11",
    "description": "Jakarta 11 is the latest version of the specification and is near to be delivered to the market, that is why we need to know which application servers on the market supported and for this workshop, I will show you how to use with Payara 7.<br><b>Topic to be covered:</b><br> 1.Payara Introduction.<br>2.How to install and use Payara 7.<br>3.Create an MVC application with Payara 7.<br>4.Enable Jakarta Data with Payara 7.<br>5.Use Security with Payara 7. <br>6.Other important updates for Jakarta 11 available on Payara 7.",
    "audience_level": "Intermediate",
    "talk_format": "Workshop (\u003e 60 minutes)",
    "language": "es",
    "display": true,
    "featured": false,
    "tags": [
      "Server side development"
    ],
    "speakers": [
      "alfonso-valdez"
    ]
  },
  {
    "id": 115,
    "title": "Database Change Management for Java Developers",
    "abstract": "Domina la gestión de cambios en bases de datos con Flyway. Aprende a versionar esquemas, aplicar rollbacks y automatizar migraciones en pipelines CI/CD. Asegura despliegues controlados, minimiza riesgos y mantén la integridad de tus datos en entornos empresariales.",
    "description": "<h2>Objetivo General</h2><p>Capacitar a los participantes en la gestión de cambios de bases de datos mediante herramientas modernas, automatizando despliegues y aplicando buenas prácticas de migración en entornos empresariales, incluyendo arquitecturas multitenancy.</p><h2>MÓDULO 1: Fundamentos de Database Change Management</h2><h3>Introducción</h3><ul><li>¿Qué es Database Change Management (DCM)?</li><li>Retos comunes en la gestión de cambios de bases de datos.</li><li>¿Por qué es clave en entornos DevOps y CI/CD?</li></ul>\n<h3>Conceptos Clave </h3><ul><li>State-Based vs Migration-Based Approaches.</li><li>Versionado de esquemas y control de cambios.</li><li>Rollbacks: ¿Cuándo y cómo aplicarlos?</li><li>Importancia de los entornos sincronizados (Dev, QA, Prod).</li></ul><h3>Herramientas en el Ecosistema Java</h3><ul><li><strong>Flyway</strong>: Filosofía <em>Convention Over Configuration</em>.</li><li><strong>Liquibase</strong>: Definición declarativa de cambios.</li><li>¿Cuándo usar cada herramienta? Casos prácticos.</li></ul><h2>MÓDULO 2: Creación de Proyecto en Distinta Tecnología</h2><h3>Preparando el Entorno con Flyway</h3><ul><li>Java</li><li>Jakarta EE</li><li>Quarkus</li><li>Spring Boot</li></ul><h3>Primeras Migraciones</h3><ul><li>Creación de la primera versión de esquema: <code>V1__init.sql</code>.</li><li>Migraciones de datos iniciales.</li><li>Organización de archivos de migración.</li></ul><h2>MÓDULO 3: Flyway Avanzado y Rollbacks</h2><h3>Características Avanzadas de Flyway</h3><ul><li>Versioned Migrations vs Repeatable Migrations.</li><li>Control de checksums y validaciones.<h3>Implementación de Rollbacks</h3></li><li>Estrategias de rollback en Flyway.</li><li>Creación de scripts de reversión.</li><li>Simulación de fallos y recuperación controlada.<h2>MÓDULO 4: CI/CD Pipeline con GitHub Actions</h2><h3>Automatización de Migraciones</h3></li><li>Principios de Integración y Despliegue Continuo.</li><li>¿Por qué automatizar migraciones en el pipeline?<h3>Creación del Pipeline</h3></li><li>Configurar GitHub Actions para ejecutar:<ul><li>Build del proyecto.</li><li>Ejecución de migraciones con Flyway.</li><li>Simulación de despliegue a <em>staging</em>.</li></ul></li></ul><h2>MÓDULO 5: Migraciones en Ambientes Multitenancy y Escalabilidad con Vaadin Flow</h2><h3>Estrategias de Multitenancy</h3><ul><li>Base de datos por cliente (<em>Solo para explicar concepto</em>).</li><li>Esquema por cliente (<em>Se utilizará para hacer la demo</em>).</li><li>Filtro por columna (<em>Solo para explicar concepto</em>).<h3>Implementación en Vaadin Flow</h3></li><li>Cargar dinámicamente configuraciones de bases de datos.</li><li>Crear un servicio de migración dinámico con Flyway.</li></ul><h2>Cierre y Ronda de Preguntas</h2><hr><h2>Materiales Incluidos</h2><ul><li>Repositorio de los distintos proyectos y migraciones.</li><li>Plantilla de pipeline de GitHub Actions.</li><li>Scripts de migración y rollback.</li><li>Estrategia multitenancy con código de ejemplo.</li><li>Cheatsheet de comandos Flyway y buenas prácticas.</li></ul>",
    "audience_level": "Intermediate",
    "talk_format": "Workshop (\u003e 60 minutes)",
    "language": "es",
    "display": true,
    "featured": false,
    "tags": [
      "Java",
      "Database",
      "DCM",
      "DevOps",
      "CI/CD",
      "Flyway",
      "Liquibase",
      "Jakarta EE",
      "Spring Boot",
      "Quarkus",
      "GitHub Actions",
      "Pipeline",
      "Multitenancy",
      "Vaadin Flow"
    ],
    "speakers": [
      "freddy-pena"
    ]
  },
  {
    "id": 116,
    "title": "AI: It AI-n't What You Think!",
    "abstract": "Innovations have transformed human lives, in ways that we can't imagine how people survived before. Yet, we do not embrace innovations readily and we shouldn't in most cases. Our time in this world is juxtaposed with yet another major innovation in our field. Is AI going to take over the world, our jobs, our way of life...and more are questions that are asked frequently these days. Come to this keynote to learn how to ride the new wave instead of being swept under.",
    "description": "Innovations have transformed human lives, in ways that we can't imagine how people survived before. Yet, we do not embrace innovations readily and we shouldn't in most cases. Our time in this world is juxtaposed with yet another major innovation in our field. Is AI going to take over the world, our jobs, our way of life...and more are questions that are asked frequently these days. Come to this keynote to learn how to ride the new wave instead of being swept under.",
    "audience_level": "All",
    "talk_format": "Keynote (~30-45 minutes)",
    "language": "en",
    "display": true,
    "featured": true,
    "tags": [
      "AI",
      "Innovation"
    ],
    "speakers": [
      "venkat-subramaniam"
    ]
  },
  {
    "id": 117,
    "title": "Java: This Ain't Your Parent's Java",
    "abstract": "Java was once a language that dragged along at snail's pace. Thankfully, that's no longer the case. In the recent years the pace of development has accelerated, both in language features and in the JDK improvements. Come along to dive into some of the recent changes of Java that are both fun and powerful to use, to learn how you can benefit from these, and we'll also discuss where the language is heading in the near future.",
    "description": "Java was once a language that dragged along at snail's pace. Thankfully, that's no longer the case. In the recent years the pace of development has accelerated, both in language features and in the JDK improvements. Come along to dive into some of the recent changes of Java that are both fun and powerful to use, to learn how you can benefit from these, and we'll also discuss where the language is heading in the near future.",
    "audience_level": "Intermediate",
    "talk_format": "Talk (~30-45 minutes)",
    "language": "en",
    "display": true,
    "featured": true,
    "tags": [
      "Java",
      "JDK",
      "JVM"
    ],
    "speakers": [
      "venkat-subramaniam"
    ]
  },
  {
    "id": 118,
    "title": "OpenTelemetry para todos",
    "abstract": "OpenTelemetry es un framework para implementar observabilidad, en este taller queremos mostrar las  ventajas y el porqué es importante adoptar OpenTelemetry.",
    "description": "OpenTelemetry es un proyecto de la CNCF(Cloud Native Computing Foundation), en concreto es un framework para implementar observabilidad.<br><br>El hecho de que sea: <b>Vendor- and tool- agnostic</b> a veces en lugar de ayudar a adoptarlo confunde y crea cierta resistencia innecesaria a su difusión.<br><br>Está formado por varios componentes, y la intención de este taller es mostrar un repaso didáctico de todos estos componentes.<br><br><h2>Temario</h2><ol><li>Introducción.<ol><li> ¿Por qué es necesario?.</li><li> Metricas.</li><li> Logs.</li><li> Traces.</li><li> ¿MELT?</li><li> OpenTelemetry Framework<ul><li>OTLP. OpenTelemetry Protocol.</li><li>Signals.</li><li>Documentación de Referencia.</li></ul></li></ol></li><li>Componentes Clave.</li><li>Referencias.</li><li>Dónde seguir.</li><li>Laboratorios. <ol><li>Instrumentación</li><li> Instrumentación Automática.</li><li> Instrumentación con librerías.</li><li> Instrumentación Manual.</li></ol></li><li>Troubleshooting.</li></ol>",
    "audience_level": "All",
    "talk_format": "Workshop (\u003e 60 minutes)",
    "language": "es",
    "display": true,
    "featured": false,
    "tags": [
      "java",
      "openTelemetry",
      "observability"
    ],
    "speakers": [
      "isaac-ruiz"
    ]
  }
]